result_txt/test1_32memtable_compaction_latency_result.txt
========== fillrandom] Test1 MemTable size Compaction Latency ===========
benchmark.Run() start : 1626587389784639
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Date:	Sun Jul 18 14:49:49 2021
Keys:       16 bytes each (+ 0 bytes user-defined timestamp)
Values:     512 bytes each (256 bytes after compression)
Entries:    50000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    25177.0 MB (estimated)
FileSize:   12970.0 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: Snappy
Compression sampling rate: 0
Memtablerep: skip_list
Perf Level: 3
WARNING: Assertions are enabled; benchmarks unnecessarily slow
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
DB path: [../mnt]
1626587393297744 1-Level CompactionJob::Run() [ 7 0 0 0 0 0 0 ] to level-1 total output files 0 (write 0 MB))
1626587396519497 2-Level CompactionJob::Run() [ 7 4 0 0 0 0 0 ] to level-1 total output files 0 (write 0 MB))
1626587400220732 2-Level CompactionJob::Run() [ 7 4 0 0 0 0 0 ] to level-1 total output files 0 (write 0 MB))
1626587403895796 2-Level CompactionJob::Run() [ 8 4 0 0 0 0 0 ] to level-1 total output files 0 (write 0 MB))
1626587407813983 2-Level CompactionJob::Run() [ 1 1 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587408769441 2-Level CompactionJob::Run() [ 1 1 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587409735493 2-Level CompactionJob::Run() [ 13 6 0 0 0 0 0 ] to level-1 total output files 0 (write 0 MB))
1626587415776085 2-Level CompactionJob::Run() [ 1 1 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587416767683 2-Level CompactionJob::Run() [ 1 1 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587417721973 2-Level CompactionJob::Run() [ 1 1 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587418674601 2-Level CompactionJob::Run() [ 1 1 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587419601791 2-Level CompactionJob::Run() [ 15 9 0 0 0 0 0 ] to level-1 total output files 0 (write 0 MB))
1626587427015373 2-Level CompactionJob::Run() [ 1 1 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587427881986 2-Level CompactionJob::Run() [ 1 1 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587428826887 2-Level CompactionJob::Run() [ 1 1 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587429771022 2-Level CompactionJob::Run() [ 1 1 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587430702312 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587432071231 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587433404394 2-Level CompactionJob::Run() [ 19 11 0 0 0 0 0 ] to level-1 total output files 0 (write 0 MB))
1626587442452711 2-Level CompactionJob::Run() [ 1 1 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587443367909 2-Level CompactionJob::Run() [ 1 1 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587444290920 2-Level CompactionJob::Run() [ 2 1 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587445710267 2-Level CompactionJob::Run() [ 2 1 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587447073334 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587448414813 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587449704986 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587451066366 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587452165024 2-Level CompactionJob::Run() [ 20 11 0 0 0 0 0 ] to level-1 total output files 0 (write 0 MB))
1626587461621563 2-Level CompactionJob::Run() [ 1 1 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587462059929 2-Level CompactionJob::Run() [ 1 1 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587463044201 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587464244678 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587465444342 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587466722157 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587468021733 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587469334606 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587470735686 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587471873681 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587472925924 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587473941416 2-Level CompactionJob::Run() [ 20 11 0 0 0 0 0 ] to level-1 total output files 0 (write 0 MB))
1626587483495723 2-Level CompactionJob::Run() [ 1 1 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587484421742 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587485682556 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587486984520 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587488235293 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587489468100 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587490573275 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587491928547 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587493117298 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587494315157 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587495708719 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587497227435 2-Level CompactionJob::Run() [ 21 11 0 0 0 0 0 ] to level-1 total output files 0 (write 0 MB))
1626587506874225 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587508098778 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587509258009 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587510360460 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587511757298 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587513116102 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587514617615 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587516187799 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587517558312 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587518962132 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587520544417 2-Level CompactionJob::Run() [ 21 13 0 0 0 0 0 ] to level-1 total output files 0 (write 0 MB))
1626587530770646 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587532094636 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587533491650 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587534878118 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587536360864 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587537963957 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587539215015 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587540887129 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587542504977 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587544134939 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587545773876 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587547383732 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587549006716 2-Level CompactionJob::Run() [ 21 12 0 0 0 0 0 ] to level-1 total output files 0 (write 0 MB))
1626587559301583 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587560320776 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587561695678 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587563106434 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587564479456 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587566226184 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587567922385 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587569380517 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587570971262 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587572625938 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587574230515 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587575902986 2-Level CompactionJob::Run() [ 21 13 0 0 0 0 0 ] to level-1 total output files 0 (write 0 MB))
1626587586292101 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587587536908 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587589244873 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587591083428 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587592919550 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587594759118 2-Level CompactionJob::Run() [ 1 1 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587595345810 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587596670356 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587598436357 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587600386309 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587602289847 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587604312745 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587606403922 2-Level CompactionJob::Run() [ 21 13 0 0 0 0 0 ] to level-1 total output files 0 (write 0 MB))
1626587616825525 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587618513517 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587620186215 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587621867620 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587623577941 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587625342832 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587626940910 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587628503713 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587630165683 2-Level CompactionJob::Run() [ 1 1 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587630668165 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587632635873 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587634728394 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587636882243 2-Level CompactionJob::Run() [ 21 13 0 0 0 0 0 ] to level-1 total output files 0 (write 0 MB))
1626587647252179 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587648878473 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587650558582 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587652355025 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587654144622 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587655936149 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587657648353 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587659413131 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587661325670 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587663232873 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587665184168 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587667324849 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587669621136 2-Level CompactionJob::Run() [ 22 13 0 0 0 0 0 ] to level-1 total output files 0 (write 0 MB))
1626587679938755 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587681578989 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587683501047 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587685504709 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587687646656 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587689469678 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587691737460 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587694073213 2-Level CompactionJob::Run() [ 1 6 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587696370899 2-Level CompactionJob::Run() [ 1 6 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587698676908 2-Level CompactionJob::Run() [ 1 2 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587699626622 2-Level CompactionJob::Run() [ 1 6 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587702054842 2-Level CompactionJob::Run() [ 1 6 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587704438907 2-Level CompactionJob::Run() [ 22 13 0 0 0 0 0 ] to level-1 total output files 0 (write 0 MB))
1626587714987284 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587717022963 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587719198419 2-Level CompactionJob::Run() [ 1 1 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587719755084 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587721433279 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587723746804 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587725796991 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587727856980 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587729453496 2-Level CompactionJob::Run() [ 1 6 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587731624947 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587733898628 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587736144698 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587738443252 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587740503272 2-Level CompactionJob::Run() [ 22 13 0 0 0 0 0 ] to level-1 total output files 0 (write 0 MB))
1626587751079613 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587753135061 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587755222912 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587756656283 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587758367539 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587760515739 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587762503065 2-Level CompactionJob::Run() [ 1 6 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587764596541 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587766658976 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587769018588 2-Level CompactionJob::Run() [ 1 6 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587771392989 2-Level CompactionJob::Run() [ 1 6 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587773877711 2-Level CompactionJob::Run() [ 1 6 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587776299916 2-Level CompactionJob::Run() [ 22 13 0 0 0 0 0 ] to level-1 total output files 0 (write 0 MB))
1626587787006735 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587788857469 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587790748914 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587792732929 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587794898570 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587796950667 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587798910543 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587800951106 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587803151925 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587805611461 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587808116503 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587810626143 2-Level CompactionJob::Run() [ 1 6 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587813118033 2-Level CompactionJob::Run() [ 22 15 0 0 0 0 0 ] to level-1 total output files 0 (write 0 MB))
1626587824350725 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587826273974 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587828544840 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587830234693 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587832379710 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587834715867 2-Level CompactionJob::Run() [ 1 6 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587837044984 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587839393941 2-Level CompactionJob::Run() [ 1 6 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587841735434 2-Level CompactionJob::Run() [ 1 6 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587844268667 2-Level CompactionJob::Run() [ 1 6 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587846935837 2-Level CompactionJob::Run() [ 1 7 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587849608443 2-Level CompactionJob::Run() [ 1 6 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587852292092 2-Level CompactionJob::Run() [ 22 14 0 0 0 0 0 ] to level-1 total output files 0 (write 0 MB))
1626587863241563 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587864672552 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587866767541 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587868974476 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587871230439 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587873418728 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587874896909 2-Level CompactionJob::Run() [ 1 6 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587877216219 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587879514544 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587882001219 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587884323047 2-Level CompactionJob::Run() [ 1 6 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587886827306 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587888365971 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587890345599 2-Level CompactionJob::Run() [ 22 13 0 0 0 0 0 ] to level-1 total output files 0 (write 0 MB))
1626587901162492 2-Level CompactionJob::Run() [ 1 3 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587903132358 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587905223602 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587907294173 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587909522102 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587911697810 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587913819514 2-Level CompactionJob::Run() [ 1 5 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587916167001 2-Level CompactionJob::Run() [ 1 6 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587918365717 2-Level CompactionJob::Run() [ 1 6 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587920715143 2-Level CompactionJob::Run() [ 1 6 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587923344765 2-Level CompactionJob::Run() [ 1 6 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
1626587925847500 2-Level CompactionJob::Run() [ 22 17 0 0 0 0 0 ] to level-1 total output files 0 (write 0 MB))
1626587936842664 2-Level CompactionJob::Run() [ 1 4 0 0 0 0 0 ] to level-2 total output files 0 (write 0 MB))
fillrandom   :      10.941 micros/op 91396 ops/sec;   46.0 MB/s
Latency for percentile 0 : 2.000000
Latency for percentile 1 : 2.012905
Latency for percentile 2 : 2.043280
Latency for percentile 3 : 2.073654
Latency for percentile 4 : 2.104029
Latency for percentile 5 : 2.134403
Latency for percentile 6 : 2.164778
Latency for percentile 7 : 2.195152
Latency for percentile 8 : 2.225527
Latency for percentile 9 : 2.255902
Latency for percentile 10 : 2.286276
Latency for percentile 11 : 2.316651
Latency for percentile 12 : 2.347025
Latency for percentile 13 : 2.377400
Latency for percentile 14 : 2.407775
Latency for percentile 15 : 2.438149
Latency for percentile 16 : 2.468524
Latency for percentile 17 : 2.498898
Latency for percentile 18 : 2.529273
Latency for percentile 19 : 2.559647
Latency for percentile 20 : 2.590022
Latency for percentile 21 : 2.620397
Latency for percentile 22 : 2.650771
Latency for percentile 23 : 2.681146
Latency for percentile 24 : 2.711520
Latency for percentile 25 : 2.741895
Latency for percentile 26 : 2.772270
Latency for percentile 27 : 2.802644
Latency for percentile 28 : 2.833019
Latency for percentile 29 : 2.863393
Latency for percentile 30 : 2.893768
Latency for percentile 31 : 2.924142
Latency for percentile 32 : 2.954517
Latency for percentile 33 : 2.984892
Latency for percentile 34 : 3.010556
Latency for percentile 35 : 3.031560
Latency for percentile 36 : 3.052563
Latency for percentile 37 : 3.073567
Latency for percentile 38 : 3.094570
Latency for percentile 39 : 3.115574
Latency for percentile 40 : 3.136578
Latency for percentile 41 : 3.157581
Latency for percentile 42 : 3.178585
Latency for percentile 43 : 3.199588
Latency for percentile 44 : 3.220592
Latency for percentile 45 : 3.241595
Latency for percentile 46 : 3.262599
Latency for percentile 47 : 3.283602
Latency for percentile 48 : 3.304606
Latency for percentile 49 : 3.325610
Latency for percentile 50 : 3.346613
Latency for percentile 51 : 3.367617
Latency for percentile 52 : 3.388620
Latency for percentile 53 : 3.409624
Latency for percentile 54 : 3.430627
Latency for percentile 55 : 3.451631
Latency for percentile 56 : 3.472634
Latency for percentile 57 : 3.493638
Latency for percentile 58 : 3.514641
Latency for percentile 59 : 3.535645
Latency for percentile 60 : 3.556649
Latency for percentile 61 : 3.577652
Latency for percentile 62 : 3.598656
Latency for percentile 63 : 3.619659
Latency for percentile 64 : 3.640663
Latency for percentile 65 : 3.661666
Latency for percentile 66 : 3.682670
Latency for percentile 67 : 3.703673
Latency for percentile 68 : 3.724677
Latency for percentile 69 : 3.745681
Latency for percentile 70 : 3.766684
Latency for percentile 71 : 3.787688
Latency for percentile 72 : 3.808691
Latency for percentile 73 : 3.829695
Latency for percentile 74 : 3.850698
Latency for percentile 75 : 3.871702
Latency for percentile 76 : 3.892705
Latency for percentile 77 : 3.913709
Latency for percentile 78 : 3.934712
Latency for percentile 79 : 3.955716
Latency for percentile 80 : 3.976720
Latency for percentile 81 : 3.997723
Latency for percentile 82 : 4.108210
Latency for percentile 83 : 4.229576
Latency for percentile 84 : 4.350942
Latency for percentile 85 : 4.472309
Latency for percentile 86 : 4.593675
Latency for percentile 87 : 4.715041
Latency for percentile 88 : 4.836408
Latency for percentile 89 : 4.957774
Latency for percentile 90 : 5.079140
Latency for percentile 91 : 5.200507
Latency for percentile 92 : 5.321873
Latency for percentile 93 : 5.443240
Latency for percentile 94 : 5.564606
Latency for percentile 95 : 5.685972
Latency for percentile 96 : 5.807339
Latency for percentile 97 : 5.928705
Latency for percentile 98 : 7.173449
Latency for percentile 99 : 10.806218
Latency for percentile 100 : 25859.000000
Microseconds per write:
Count: 50000000 Average: 10.9414  StdDev: 20.95
Min: 2  Median: 3.3466  Max: 25859
Percentiles: P50: 3.35 P75: 3.87 P99: 10.81 P99.1: 16.76 P99.2: 19.36 P99.3: 21.96 P99.4: 884.80 P99.5: 954.14 P99.6: 1023.47 P99.7: 1092.81 P99.8: 1162.14 P99.9: 1231.48 P99.91: 1238.41 P99.92: 1245.35 P99.93: 1252.28 P99.94: 1259.22 P99.95: 1266.15 P99.96: 1273.08 P99.97: 1280.02 P99.98: 1286.95 P99.99: 1293.88
------------------------------------------------------
(       1,       2 ]   287569   0.575%   0.575% 
(       2,       3 ] 16461133  32.922%  33.497% #######
(       3,       4 ] 23805501  47.611%  81.108% ##########
(       4,       6 ]  8239515  16.479%  97.587% ###
(       6,      10 ]   703165   1.406%  98.994% 
(      10,      15 ]    19331   0.039%  99.032% 
(      15,      22 ]   134608   0.269%  99.302% 
(      22,      34 ]    35697   0.071%  99.373% 
(      34,      51 ]     1739   0.003%  99.377% 
(      51,      76 ]      554   0.001%  99.378% 
(      76,     110 ]      394   0.001%  99.378% 
(     110,     170 ]       50   0.000%  99.379% 
(     170,     250 ]       17   0.000%  99.379% 
(     250,     380 ]        9   0.000%  99.379% 
(     380,     580 ]       21   0.000%  99.379% 
(     580,     870 ]       25   0.000%  99.379% 
(     870,    1300 ]   310083   0.620%  99.999% 
(    1300,    1900 ]      106   0.000%  99.999% 
(    1900,    2900 ]      469   0.001% 100.000% 
(    2900,    4400 ]        9   0.000% 100.000% 
(    4400,    6600 ]        1   0.000% 100.000% 
(    6600,    9900 ]        2   0.000% 100.000% 
(    9900,   14000 ]        1   0.000% 100.000% 
(   22000,   33000 ]        1   0.000% 100.000% 


Level Files Size(MB)
--------------------
  0        1       37
  1       28     1567
  2      136     8143
  3       16      944
  4        0        0
  5        0        0
  6        0        0

benchmark.Run() end : 1626587936926554
========== fillseq] Test1 MemTable size Compaction Latency ===========
benchmark.Run() start : 1626587936950052
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Date:	Sun Jul 18 14:58:56 2021
Keys:       16 bytes each (+ 0 bytes user-defined timestamp)
Values:     512 bytes each (256 bytes after compression)
Entries:    50000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    25177.0 MB (estimated)
FileSize:   12970.0 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: Snappy
Compression sampling rate: 0
Memtablerep: skip_list
Perf Level: 3
WARNING: Assertions are enabled; benchmarks unnecessarily slow
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
DB path: [../mnt]
fillseq      :       2.531 micros/op 395164 ops/sec;  199.0 MB/s
Latency for percentile 0 : 2.000000
Latency for percentile 1 : 2.000000
Latency for percentile 2 : 2.000000
Latency for percentile 3 : 2.000000
Latency for percentile 4 : 2.000000
Latency for percentile 5 : 2.000000
Latency for percentile 6 : 2.000000
Latency for percentile 7 : 2.000000
Latency for percentile 8 : 2.000000
Latency for percentile 9 : 2.000000
Latency for percentile 10 : 2.000000
Latency for percentile 11 : 2.000000
Latency for percentile 12 : 2.000000
Latency for percentile 13 : 2.000000
Latency for percentile 14 : 2.000000
Latency for percentile 15 : 2.000000
Latency for percentile 16 : 2.000000
Latency for percentile 17 : 2.000000
Latency for percentile 18 : 2.000000
Latency for percentile 19 : 2.000000
Latency for percentile 20 : 2.000000
Latency for percentile 21 : 2.000000
Latency for percentile 22 : 2.000000
Latency for percentile 23 : 2.000000
Latency for percentile 24 : 2.000000
Latency for percentile 25 : 2.000000
Latency for percentile 26 : 2.000000
Latency for percentile 27 : 2.000000
Latency for percentile 28 : 2.000000
Latency for percentile 29 : 2.000000
Latency for percentile 30 : 2.000000
Latency for percentile 31 : 2.000000
Latency for percentile 32 : 2.000000
Latency for percentile 33 : 2.000000
Latency for percentile 34 : 2.000000
Latency for percentile 35 : 2.000000
Latency for percentile 36 : 2.000000
Latency for percentile 37 : 2.000000
Latency for percentile 38 : 2.000000
Latency for percentile 39 : 2.000000
Latency for percentile 40 : 2.000000
Latency for percentile 41 : 2.000000
Latency for percentile 42 : 2.000000
Latency for percentile 43 : 2.000000
Latency for percentile 44 : 2.000000
Latency for percentile 45 : 2.000000
Latency for percentile 46 : 2.000000
Latency for percentile 47 : 2.000000
Latency for percentile 48 : 2.000000
Latency for percentile 49 : 2.000000
Latency for percentile 50 : 2.000000
Latency for percentile 51 : 2.000000
Latency for percentile 52 : 2.000000
Latency for percentile 53 : 2.000000
Latency for percentile 54 : 2.000000
Latency for percentile 55 : 2.000000
Latency for percentile 56 : 2.000000
Latency for percentile 57 : 2.000000
Latency for percentile 58 : 2.000000
Latency for percentile 59 : 2.000000
Latency for percentile 60 : 2.023067
Latency for percentile 61 : 2.054344
Latency for percentile 62 : 2.085621
Latency for percentile 63 : 2.116897
Latency for percentile 64 : 2.148174
Latency for percentile 65 : 2.179451
Latency for percentile 66 : 2.210728
Latency for percentile 67 : 2.242005
Latency for percentile 68 : 2.273281
Latency for percentile 69 : 2.304558
Latency for percentile 70 : 2.335835
Latency for percentile 71 : 2.367112
Latency for percentile 72 : 2.398389
Latency for percentile 73 : 2.429666
Latency for percentile 74 : 2.460942
Latency for percentile 75 : 2.492219
Latency for percentile 76 : 2.523496
Latency for percentile 77 : 2.554773
Latency for percentile 78 : 2.586050
Latency for percentile 79 : 2.617327
Latency for percentile 80 : 2.648603
Latency for percentile 81 : 2.679880
Latency for percentile 82 : 2.711157
Latency for percentile 83 : 2.742434
Latency for percentile 84 : 2.773711
Latency for percentile 85 : 2.804987
Latency for percentile 86 : 2.836264
Latency for percentile 87 : 2.867541
Latency for percentile 88 : 2.898818
Latency for percentile 89 : 2.930095
Latency for percentile 90 : 2.961372
Latency for percentile 91 : 2.992648
Latency for percentile 92 : 3.096562
Latency for percentile 93 : 3.222795
Latency for percentile 94 : 3.349028
Latency for percentile 95 : 3.475261
Latency for percentile 96 : 3.601495
Latency for percentile 97 : 3.727728
Latency for percentile 98 : 3.853961
Latency for percentile 99 : 3.980194
Latency for percentile 100 : 6113.000000
Microseconds per write:
Count: 50000000 Average: 2.5306  StdDev: 1.46
Min: 2  Median: 2.0000  Max: 6113
Percentiles: P50: 2.00 P75: 2.49 P99: 3.98 P99.1: 3.99 P99.2: 4.15 P99.3: 4.49 P99.4: 4.83 P99.5: 5.17 P99.6: 5.51 P99.7: 5.85 P99.8: 7.75 P99.9: 16.94 P99.91: 17.83 P99.92: 18.71 P99.93: 19.60 P99.94: 20.48 P99.95: 21.37 P99.96: 22.93 P99.97: 26.14 P99.98: 29.35 P99.99: 32.56
------------------------------------------------------
(       1,       2 ] 29631246  59.262%  59.262% ############
(       2,       3 ] 15986279  31.973%  91.235% ######
(       3,       4 ]  3960925   7.922%  99.157% ##
(       4,       6 ]   292985   0.586%  99.743% 
(       6,      10 ]    65346   0.131%  99.874% 
(      10,      15 ]     2282   0.005%  99.878% 
(      15,      22 ]    39485   0.079%  99.957% 
(      22,      34 ]    18701   0.037%  99.994% 
(      34,      51 ]     1099   0.002%  99.997% 
(      51,      76 ]      750   0.002%  99.998% 
(      76,     110 ]      718   0.001% 100.000% 
(     110,     170 ]      143   0.000% 100.000% 
(     170,     250 ]       18   0.000% 100.000% 
(     250,     380 ]        4   0.000% 100.000% 
(     380,     580 ]        1   0.000% 100.000% 
(     580,     870 ]       16   0.000% 100.000% 
(     870,    1300 ]        1   0.000% 100.000% 
(    4400,    6600 ]        1   0.000% 100.000% 


Level Files Size(MB)
--------------------
  0        7      242
  1        7      243
  2       73     2527
  3      332    11498
  4        0        0
  5        0        0
  6        0        0

benchmark.Run() end : 1626588063551040